app/views/stories/show.html.erb


      <p>Type of Food: <span class="storyFoodCategory"><%= @story.food.category.name if @story.food.category.name.present? %></span></p>
---
SELECT "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]